system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1200;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   30;// 0.1;

purgeWrite      0;

writeFormat     ascii; //binary;  //faster, less space

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5; //0.75;//0.2; //1;

functions
{
    #includeFunc  singleGraph_y  //sample data along y
    #includeFunc  probes         //sample data at several points

    hrr
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);

        writeControl    timeStep; //writeTime;
        writeInterval   1; //10;
        writeFields     false;
        log             true;

        operation       volIntegrate;

        fields
        (
            Qdot
        );
    }
}
functions
{
    myResiduals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");

        // List the fields to monitor (add more as needed)
        fields          (p U k epsilon h batteryGasNMC);

        // Optional: Set to 'yes' to also output residual fields to time directories
        // writeResidualFields yes;

        // Optional: Control when to execute (defaults to timeStep if unspecified)
        // executeControl  timeStep;
        // executeInterval 1;
    }
}
// ************************************************************************* //
