system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh true;
snap            true;
addLayers       false;  //true;

geometry
{
    little_head_6parts_m.stl  //the whole geo
    {
        type triSurfaceMesh;
        name little_head_6parts_m;
    }
    live_pack_inner_area   //live pack 
    {
        type searchableBox;
        min (0   0 0.3);
        max (0.9 1.5 1.3);
    }
    live_pack_inner_area_2   //live pack 
    {
        type searchableBox;
        min (0   0   0.5);
        max (0.9 1.2 0.8);
    }
}

castellatedMeshControls
{
   //Refinement parameters

    maxLocalCells   100000;
    maxGlobalCells  2000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    
    nCellsBetweenLevels 3;

    
    // Explicit feature edge refinement    
    features 
    (
        {
            file "little_head_6parts_m.eMesh";
            level 1; //was 6
        }
    );

    // Surface based refinement

    refinementSurfaces
    {
        little_head_6parts_m
        {
            // Surface-wise min and max refinement level
            level (1 1); //(1 1)
        }
    // Resolve sharp angles
    resolveFeatureAngle 10;
    }
    refinementRegions 
    {
        live_pack_inner_area
        {
            mode inside;
            levels ((2 2));
        }
        live_pack_inner_area_2
        {
            mode inside;
            levels ((3 3));
        }
    }
    locationInMesh (0.1 0.1 3.0);
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 100;  //30;
    nRelaxIter 10;   //5;

    nFeatureSnapIter 20;  //10; 

    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    minThickness 0.1;
    finalLayerThickness 0.5;
    expansionRatio 1.2;
    layers 
    {
        little_head_6parts_m
        {
            nSurfaceLayers  3;
            //local parameters
          //  minThickness 0.1;
          //  finalLayerThickness 0.5;
          //  expansionRatio 1.2;
        }

    }
}

meshQualityControls
{
    #includeEtc "caseDicts/mesh/generation/meshQualityDict.cfg"
}

// ************************************************************************* //
