0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01310e5; // 15 Pa lower than atm 1.01325e5;

boundaryField
{
    top
    {
        type            zeroGradient;
//        type            totalPressure;
//        p0              $internalField;
//        gamma           1.4;
//        phi             phi;        
    }
    left
    {
        type            symmetryPlane;
    }
    inlet
    {
//        type            zeroGradient;
        type            uniformTotalPressure; //zeroGradient;
        p0              $internalField; 
        gamma           1.4;
    }
    wall_bottom
    {
        type            zeroGradient; 
    }
    vent_1
    {
        type            zeroGradient; 
    }
    wall_pack
    {
        type            zeroGradient; 
    }
    wall_top
    {
        type            zeroGradient; 
    }
    wall_side
    {
        type            zeroGradient; 
    }
}


// ************************************************************************* //
