0.org/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1.12e-2;  //C_mu*rhou*k2/(Pr_t*epsilon)

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;
    }
    left
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated; 
        value           $internalField;
    }
    wall_bottom
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    vent_1
    {
        type            calculated;
        value           $internalField;
    }
    wall_pack
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    wall_top
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    wall_side
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
}


// ************************************************************************* //
