0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.34e-1;   

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    left
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    3.8e-2;  //0.035;
        phi             phi;
        k               k;
        value           $internalField; 
    }
    wall_bottom
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    vent_1
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1.90e-3;   //1.95e-2;
        phi             phi;
        k               k;
        value           $internalField; 
    }
    wall_pack
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    wall_top
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    wall_side
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
}


// ************************************************************************* //
