0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.43e-1;  //k=3/2u'^2, u'=0.8 m/s

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    left
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;  //turbulent intensity
        value           $internalField; //placeholder
    }
    wall_bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    vent_1
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.2;  //turbulent intensity
        value           $internalField; //placeholder
    }
    wall_pack
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wall_top
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wall_side
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
