system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver            GAMG;//PCG;
        smoother        GaussSeidel;
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0.01;
    }

    pFinal
    {
        $p;
        relTol           0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6; //1e-8;
        relTol          0.1;  //0.0;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    "(h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(h|k|epsilon)Final"
    {
        $h;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }

    Phi
    {
        $p;
    }
}

PIMPLE
{
    momentumPredictor off; //on;
    nOuterCorrectors 1; //3; 
    nCorrectors     2;
    nNonOrthogonalCorrectors 0; //2;
/*                                
    residualControl
    {
        p
        {
            tolerance   1e-5;
            relTol      0;
        }
        U
        {
            tolerance   1e-5;
            relTol      0;
        }
        h
        {
            tolerance   1e-3;
            relTol      0;
        }
        "(k|epsilon)"
        {
            tolerance   1e-5;
            relTol      0;
        }
    } 
*/        
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
relaxationFactors
{
    equations
    {
        "(p).*"                                0.5; //0.7
        "(k|epsilon).*"                        0.4; //0.9
        "(U|batteryGasNMC|O2|H2O|CO2|h).*"     0.7;
    }
}
// ************************************************************************* //
