system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
//create inlet
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "little_head_6parts_m";
            }
    }
    {
        name    inlet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box (1.0 -1.6 1e-3) (1.6 -1.0 1.625);  //front
//                box (1.0 1.0 1e-3) (1.6 1.6 1.625);   //back
            }
    }
//create wall_bottom
    {
        name    wall_bottom;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "little_head_6parts_m";
            }
    }
    {
        name    wall_bottom;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box (0 -1.5 -1e-3) (1.5 1.5 1.e-3);
            }
    }
//create vent_1
    {
        name    vent_1;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "little_head_6parts_m";
            }
    }
    {
        name    vent_1;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box (-0.025 1.0245 0.7) (0.025 1.0255 0.725);  //part of the surface, 0.05 * 0.025 m
            }
    }
//create wall_pack
    {
        name    wall_pack;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "little_head_6parts_m";
            }
    }
    {
        name    wall_pack;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box (0 0.9 0.29) (1.4 1.41 1.4);
            }
    }
    {
        name    wall_pack;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     vent_1;
    }
//create wall_top
    {
        name    wall_top;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "little_head_6parts_m";
            }
    }
    {
        name    wall_top;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
            {
                box (0 -1.5 3.5) (1.5 1.5 4.6);
            }
    }
//create wall_side by subtracting
    {
        name    wall_side;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "little_head_6parts_m";
            }
    }
    {
        name    wall_side;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     inlet;
    }
    {
        name    wall_side;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     wall_bottom;
    }
    {
        name    wall_side;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     wall_top;
    }
    {
        name    wall_side;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     wall_pack;
    }
    {
        name    wall_side;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     vent_1;
    }
);


// ************************************************************************* //
